using System;

namespace Task_4
{
    /*Объявить структуру Rectangle, описывающую прямоугольник, 
    заданный длинами сторон. Структура реализует 
    интерфейс IComparable, сравнение структур происходит по величине площади прямоугольника.
    Объявить класс Block3D, описывающий «кирпич», заданный основанием и высотой. 
    Основание – объект структуры Rectangle. 
    Класс реализует интерфейс IComparable, сравнивая кирпичи по величине площади основания.
    В основной программе протестировать работу методов классов, отсортировав массив элементов типа Block3D.
    Записать его в файл, а затем восстановить из файла и вывести на экран.*/

    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
